In [1]:
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('seaborn')
plt.rcParams['figure.figsize'] = [12, 6]

In [8]:
data = pd.read_csv('ai-fall20/4. Feature Eng/08. Date Enc/3. Exercise/daily-temperatures.csv')

In [4]:
from hcrystalball.wrappers import ProphetWrapper

In [5]:
from datetime import *
from dateutil.parser import parse
data.Date = data.Date.apply(lambda x: pd.to_datetime(x,
    format='%Y-%m-%dT',
    errors='coerce'))

In [6]:
df = data

df.Date = df.Date.astype('str')
df.Date = df.Date.apply(lambda x: parse(x))
df.Date = df.Date.apply(lambda x: pd.to_datetime(x,
    format='%Y-%m-%dT',
    errors='coerce'))
df['day'] = df.Date.dt.day
df['month'] = df.Date.dt.month
df['weekday'] = df.Date.dt.weekday
df['year'] = df.Date.dt.year

In [7]:
print(data.head())
print(df.head())

        Date  Temp  day  month  weekday  year
0 1981-01-01  20.7    1      1        3  1981
1 1981-01-02  17.9    2      1        4  1981
2 1981-01-03  18.8    3      1        5  1981
3 1981-01-04  14.6    4      1        6  1981
4 1981-01-05  15.8    5      1        0  1981
        Date  Temp  day  month  weekday  year
0 1981-01-01  20.7    1      1        3  1981
1 1981-01-02  17.9    2      1        4  1981
2 1981-01-03  18.8    3      1        5  1981
3 1981-01-04  14.6    4      1        6  1981
4 1981-01-05  15.8    5      1        0  1981

In [9]:
df.head()

        Date  Temp  day  month  weekday  year
0 1981-01-01  20.7    1      1        3  1981
1 1981-01-02  17.9    2      1        4  1981
2 1981-01-03  18.8    3      1        5  1981
3 1981-01-04  14.6    4      1        6  1981
4 1981-01-05  15.8    5      1        0  1981

In [10]:
df

           Date  Temp  day  month  weekday  year
0    1981-01-01  20.7    1      1        3  1981
1    1981-01-02  17.9    2      1        4  1981
2    1981-01-03  18.8    3      1        5  1981
3    1981-01-04  14.6    4      1        6  1981
4    1981-01-05  15.8    5      1        0  1981
...         ...   ...  ...    ...      ...   ...
3645 1990-12-27  14.0   27     12        3  1990
3646 1990-12-28  13.6   28     12        4  1990
3647 1990-12-29  13.5   29     12        5  1990
3648 1990-12-30  15.7   30     12        6  1990
3649 1990-12-31  13.0   31     12        0  1990

[3650 rows x 6 columns]